{"Unit 1: Introduction to Taxes": "Based on your introduction to taxes, please explain in your own words what taxes are and how they are collected by the government. Additionally, describe two different types of taxes and provide an example of each.", "Unit 2: Federal Income Tax": "Based on your study of the Federal Income Tax, please explain in detail how taxable income is calculated and provide an example of how deductions and exemptions are applied to reduce taxable income.", "Unit 3: State and Local Taxes": "Based on your study of Unit 3: State and Local Taxes, please explain in your own words:\n\n1. What are the two main categories of state and local taxes?\n2. Provide an example of each category and describe how they differ.\n3. How do state and local taxes impact a business's decision to locate in a particular area?\n4. What are some common methods states and localities use to generate revenue from taxes?\n5. Discuss the potential consequences of relying too heavily on state and local taxes versus federal taxes.", "Unit 4: Tax Planning and Preparation": "Based on your study of Unit 4: Tax Planning and Preparation, can you explain the significance of record-keeping in tax planning and preparation? How does maintaining accurate records help taxpayers minimize their tax liability and ensure compliance with tax laws?", "Unit 5: Tax Law and Policy": "Based on your study of Unit 5: Tax Law and Policy, please explain in your own words the significance of progressive taxation in modern tax systems and provide an example of a country that implements this tax structure effectively.", "Unit 6: Advanced Tax Topics": "Based on your study of Unit 6: Advanced Tax Topics, please explain in detail how the alternative minimum tax (AMT) works and how it differs from the regular income tax. Provide an example of a situation where an individual would be subject to the AMT and calculate the difference in tax liability between the regular tax and the AMT.", "Unit 7: Taxation and Society": "Based on your study of Unit 7: Taxation and Society, please explain how the government's use of progressive taxation affects income distribution in a society, providing specific examples if possible. Additionally, discuss the potential social and economic implications of this tax policy.", "Unit 8: Taxation in the Global Economy": "Based on your study of Unit 8: Taxation in the Global Economy, please explain the main differences between direct and indirect taxes. How do these taxes impact consumers and businesses differently? Provide specific examples to illustrate your points.", "Unit 9: Taxation and the Future": "Based on your study of Unit 9: Taxation and the Future, please explain in your own words:\n\n1. What are the different types of taxes discussed in the unit?\n2. How does progressivity in taxation affect individuals with various income levels?\n3. What are the potential consequences of increasing or decreasing taxes on businesses?\n4. Describe the role of taxation in funding public services and infrastructure.\n5. What are some proposed solutions for addressing tax evasion and tax avoidance?"}