{"Unit 1: Foundations of American History": [{"name": "1.1 - Pre-Columbian America", "expanded": false, "mcq": [{"options": ["Paleoindian period", "Archaic period", "Woodland period", "Formative period"], "q": "Which period in Pre-Columbian America saw the emergence of the first complex societies and the construction of large earthen mounds for religious and ceremonial purposes?", "ans": 2}]}, {"name": "1.2 - European Exploration and Settlement", "expanded": false, "mcq": [{"options": ["Spain and France", "England and Netherlands", "France and England", "Spain and Netherlands", "Spain and France"], "q": "Which European powers primarily focused on exploring and settling the southern and northern regions of North America, respectively?", "ans": 0}]}, {"name": "1.3 - The American Revolution", "expanded": false, "mcq": [{"options": ["The Boston Tea Party in 1773", "The signing of the Treaty of Paris in 1783", "The passage of the Stamp Act in 1765", "The Battles of Lexington and Concord in 1775"], "q": "Which events marked the beginning of armed conflict in the American Revolution?", "ans": 3}]}], "Unit 2: The Colonial Period": [{"name": "2.1 - Colonial Society", "expanded": false, "mcq": [{"options": ["France and the Netherlands", "Spain and Portugal", "England and the Netherlands", "Spain and France"], "q": "Which European powers established the majority of colonies in North America during the Colonial Society period, and what were some key differences in their political structures?", "ans": 2}]}, {"name": "2.2 - Colonial Economy", "expanded": false, "mcq": [{"options": ["Capitalism", "Socialism", "Mercantilism", "Communism"], "q": "Which economic system defined the relationship between the British colonies in North America and Britain during the colonial period?", "ans": 2}]}, {"name": "2.3 - Colonial Politics", "expanded": false, "mcq": [{"options": ["Spanish and French only", "British and Dutch only", "All European powers", "None of the above", "Spanish and French only."], "q": "Which European powers formed alliances with Native American groups during the colonial politics era in North America?", "ans": 0}]}], "Unit 3: The Revolutionary Era": [{"name": "3.1 - The American Revolution", "expanded": false, "mcq": [{"options": ["The Intolerable Acts", "The Quartering Acts", "The Stamp Acts", "The Navigation Acts"], "q": "Which series of laws passed by the British Parliament in response to the Boston Tea Party are collectively known as?", "ans": 0}]}, {"name": "3.2 - The Constitution and the Bill of Rights", "expanded": false, "mcq": [{"options": ["The Preamble", "The Constitutional Amendments", "The Articles of Confederation", "The Federalist Papers"], "q": "Which part of the United States Constitution outlines the protections for individual liberties, such as freedom of speech and religion?", "ans": 1}]}, {"name": "3.3 - Early National Politics", "expanded": false, "mcq": [{"options": ["The Annapolis Convention", "The Constitutional Convention", "The election of John Adams in 1796", "The election of Thomas Jefferson in 1800"], "q": "Which event marked the first peaceful transfer of power between political parties in American history?", "ans": 3}]}], "Unit 4: The Early Republic": [{"name": "4.1 - The Jeffersonian Era", "expanded": false, "mcq": [{"options": ["The Embargo Act of 1807", "The Louisiana Purchase in 1803", "The French Revolution's influence on American politics", "The decline of the Federalist Party"], "q": "Which event during the Jeffersonian Era significantly expanded the size of the United States and set the stage for westward expansion?", "ans": 1}]}, {"name": "4.2 - The Era of Good Feelings", "expanded": false, "mcq": [{"options": ["The establishment of the Democratic Party and the construction of the Chesapeake and Ohio Canal", "The War of 1812 and the uncontested election of James Monroe", "The Second Bank of the United States and the increase in agricultural production", "The rise of national identity and the first contested election since George Washington"], "q": "Which events marked the economic growth during the Era of Good Feelings in the United States?", "ans": 2}]}, {"name": "4.3 - The Jacksonian Era", "expanded": false, "mcq": [{"options": ["The passage of the Indian Removal Act", "The implementation of the spoils system", "The establishment of women's suffrage activism", "The creation of the Second Bank of the United States"], "q": "Which event during the Jacksonian Era led to the relocation of thousands of Native Americans, resulting in numerous deaths?", "ans": 0}]}], "Unit 5: Antebellum America": [{"name": "5.1 - Economic and Social Change", "expanded": false, "mcq": [{"options": ["Industrial Revolution", "Gilded Age", "Progressive Era", "New Deal"], "q": "Which era in American history is characterized by the emergence of big business, rapid urbanization, and widespread poverty and inequality?", "ans": 1}]}, {"name": "5.2 - Sectionalism and the Antebellum Period", "expanded": false, "mcq": [{"options": ["Protectionist tariffs and free trade", "Free trade and protectionist tariffs in the North", "Protectionist tariffs only in the North", "Free trade only in the South", "Protectionist tariffs and free trade"], "q": "Which economic policies contributed to the growing divide between the Northern and Southern regions during the Antebellum Period?", "ans": 0}]}, {"name": "5.3 - The Road to Civil War", "expanded": false, "mcq": [{"options": ["The Compromise of 1850 and the Fugitive Slave Act", "The election of Abraham Lincoln and his opposition to slavery", "The Dred Scott decision and its denial of citizenship to African Americans", "The economic differences between the North's industrial economy and the South's agricultural economy"], "q": "Which event or series of events significantly worsened tensions between the Northern and Southern states and contributed to the outbreak of the American Civil War?", "ans": 2}]}], "Unit 6: The Civil War and Reconstruction": [{"name": "6.1 - The Civil War", "expanded": false, "mcq": [{"options": ["The First Battle of Bull Run", "The election of Abraham Lincoln", "The passing of the Emancipation Proclamation", "The formation of the Confederate States of America"], "q": "Which event marked the beginning of the process to end slavery in the United States during the Civil War?", "ans": 2}]}, {"name": "6.2 - Reconstruction", "expanded": false, "mcq": [{"options": ["Pre-Columbian Era to 1607", "Colonial Period (1607-1754)", "Early National Period (1800-1877)", "Industrialization and Reform (1877-1914)"], "q": "Which period of American history saw the expansion of the United States, the growth of industry and agriculture, and the emergence of sectionalism and political parties?", "ans": 2}]}, {"name": "6.3 - The End of Reconstruction", "expanded": false, "mcq": [{"options": ["Passage of the Civil Rights Act of 1866", "Ratification of the Fourteenth Amendment", "Compromise of 1877 and Rutherford B. Hayes' presidency", "Establishment of the first Freedmen's Bureau schools"], "q": "Which event marked the end of Reconstruction and led to the withdrawal of federal troops from the South, allowing for the reinstatement of white supremacy laws?", "ans": 2}]}], "Unit 7: The Rise of Industrial America": [{"name": "7.1 - Industrialization", "expanded": false, "mcq": [{"options": ["The availability of abundant natural resources", "The expansion of transportation networks", "The rise of new technologies", "The emergence of a new urban working class"], "q": "Which factors contributed the most to the shift from an agrarian to an industrial economy in the United States between the 1870s and the early 20th century?", "ans": 2}]}, {"name": "7.2 - Urbanization", "expanded": false, "mcq": [{"options": ["The colonial era and the shift from agricultural economies to industrial ones", "The post-World War II era and the rise of suburbanization", "The Progressive Era and the decline of urban industries", "The late 19th and early 20th centuries and the growth of rural economies"], "q": "Which historical period and processes led to the rapid growth of American cities and the emergence of urban centers as centers of commerce, culture, and political influence?", "ans": 0}]}, {"name": "7.3 - The Progressive Era", "expanded": false, "mcq": [{"options": ["Education and immigration", "Business practices and consumer protection", "Social welfare and public health", "Foreign policy and military expansion"], "q": "Which areas of reform were a major focus for Progressives during the Progressive Era in US History?", "ans": 2}]}], "Unit 8: The Modern Era": [{"name": "8.1 - World War I", "expanded": false, "mcq": [{"options": ["The interception of the Zimmermann Telegram proposing a military alliance between Germany and Mexico", "The successful offensives of American troops in France turning the tide of the war", "The labor shortage caused by drafted soldiers leaving for the front", "The increased federal power and spending during the war"], "q": "Which events led the United States to enter World War I in 1917?", "ans": 0}]}, {"name": "8.2 - The Roaring Twenties", "expanded": false, "mcq": [{"options": ["The rise of industrial production and consumerism", "The rejection of Victorian values and the shift towards modernity", "The period of political instability and economic downturn", "The expansion of industries such as automobiles, radio, and film"], "q": "Which social and cultural trends characterized the Roaring Twenties in the United States?", "ans": 1}]}, {"name": "8.3 - The Great Depression", "expanded": false, "mcq": [{"options": ["The New Deal's implementation in 1933, leading to increased government intervention and relief programs", "The stock market crash of 1929, causing a loss of investor confidence and declining stock prices", "The overproduction of agricultural goods in the late 1920s, resulting in low prices and financial instability for farmers", "The entry of the United States into World War II in 1941, bringing about an economic recovery"], "q": "Which event is commonly identified as the starting point of the Great Depression, and what was its primary impact on the economy?", "ans": 1}]}], "Unit 9: Post-World War II America": [{"name": "9.1 - Post-War America", "expanded": false, "mcq": [{"options": ["The establishment of the interstate highway system and the rise of consumerism", "The Montgomery Bus Boycott and the March on Washington for Jobs and Freedom", "The New Deal coalition's fracture and the rise of the conservative movement", "The end of World War II and the onset of the Cold War"], "q": "Which major events characterized the social transformations during the Post-War America era (1945-1975)?", "ans": 1}]}, {"name": "9.2 - The Civil Rights Movement", "expanded": false, "mcq": [{"options": ["The March on Washington for Jobs and Freedom", "The Montgomery Bus Boycott sparked by Rosa Parks", "The passage of the Civil Rights Act of 1964", "The Voting Rights Act of 1965"], "q": "Which event is recognized as a major turning point in the Civil Rights Movement, leading to the desegregation of public transportation?", "ans": 1}]}, {"name": "9.3 - The Vietnam War", "expanded": false, "mcq": [{"options": ["The Geneva Accords of 1954", "The French defeat in Indochina after World War II", "President Kennedy sending military advisors in 1961", "President Johnson's Gulf of Tonkin Resolution in 1964"], "q": "Which event marked the beginning of the large-scale American involvement in the Vietnam War?", "ans": 2}]}]}