{"Unit 1: Limits and Continuity": "\"Can you explain how the limit of a function at a point relates to the continuity of the function at that point? Provide an example of a function that is continuous at a certain point but discontinuous at another, and explain why.\"", "Unit 2: Differentiation: Definition and Fundamental Properties": "Based on your study of Unit 2: Differentiation, please explain in your own words:\n\n1. What is the definition of differentiation in mathematics?\n2. Describe the fundamental properties of a differentiable function.\n3. How does the concept of differentiation relate to the idea of a function's rate of change?\n4. Can you provide an example of a differentiable function and find its derivative?", "Unit 3: Differentiation: Composite, Implicit, and Inverse Functions": "Can you explain the main differences between composite, implicit, and inverse functions, providing examples for each to clarify your response? How do these functions relate to one another, and how can you identify which function type a given equation represents?", "Unit 4: Applications of Derivatives": "If a function f(x) has a local maximum value at x = a, explain in your own words how you would find the value of the maximum using the definition of a derivative and the First Derivative Test. Provide an example function and calculate the maximum value.", "Unit 5: Integration and Accumulation of Change": "Based on your study of Unit 5: Integration and Accumulation of Change, please explain how the concept of integration differs from the concept of accumulation in the context of economic growth. Provide specific examples or models to support your answer.", "Unit 6: Differential Equations": "Based on your study of differential equations, consider the following scenario: A population of bacteria grows exponentially with an initial population of 1000 and a growth rate of 0.2 per hour. Write the differential equation that describes this situation and find the population size after 4 hours. Explain your answer in detail.", "Unit 7: Applications of Integration": "Based on your study of Unit 7: Applications of Integration, please explain how you would find the area under the curve of the function f(x) = x^2 from x = 0 to x = 2 using integration? Additionally, describe the role of the definite integral in determining the area of this region."}