{"Unit 1: Geography: Its Nature and Perspectives": [{"name": "1.1 - Location", "expanded": false, "mcq": [{"options": ["Climate and topography", "Natural resources and cultural traditions", "Language and ethnicity", "Political and economic systems"], "q": "Which factors are most important in influencing the location of agricultural productivity and economic activities according to AP Human Geography?", "ans": 1}]}, {"name": "1.2 - Space", "expanded": false, "mcq": [{"options": ["By creating urban areas with high population density and advanced transportation networks", "By extracting natural resources for industrialization and economic growth", "By altering natural landscapes for agricultural purposes, such as irrigation and deforestation", "By building structures to protect against natural disasters, such as hurricanes and earthquakes"], "q": "Which of the following best describes how humans modify the environment to meet their needs, according to the Space subtopic in AP Human Geography?", "ans": 2}]}, {"name": "1.3 - Place", "expanded": false, "mcq": [{"options": ["Spatial Analysis", "Place and Region", "Human-Environment Interaction", "Movement and Migration"], "q": "According to the AP Human Geography curriculum, which theme focuses on the study of the physical and human characteristics of specific places and regions, and the interconnections between them?", "ans": 1}]}, {"name": "1.4 - Scale", "expanded": false, "mcq": [{"options": ["Global", "Regional", "Local", "Macro"], "q": "Which level of analysis in AP Human Geography focuses primarily on the distribution of population, economic activities, and cultural practices within a specific area?", "ans": 2}]}, {"name": "1.5 - Pattern", "expanded": false, "mcq": [{"options": ["Political instability and natural disasters", "Economic opportunities and cultural practices", "Climate and natural resources", "Population growth and urbanization"], "q": "Which factors primarily influence the distribution and density of human populations around the world according to AP Human Geography?", "ans": 2}]}, {"name": "1.6 - Nature and Society", "expanded": false, "mcq": [{"options": ["Humans have no impact on the natural environment", "Humans depend solely on natural resources for survival", "Human activities have no influence on the natural environment", "Humans interact with the natural environment in complex and dynamic ways, shaping human settlements and cultures while also impacting the environment with activities such as agriculture, industrialization, and resource extraction."], "q": "Which of the following best describes the relationship between humans and the natural environment according to AP Human Geography?", "ans": 3}]}, {"name": "1.7 - Regionalization", "expanded": false, "mcq": [{"options": ["Political boundaries and population density", "Economic systems and cultural practices", "Physical features such as climate, topography, and natural resources", "Human population and technological advancements", "Physical features such as climate, topography, and natural resources."], "q": "Which factors do geographers consider when regionalizing Earth's surface into distinct areas?", "ans": 2}]}, {"name": "1.8 - Globalization", "expanded": false, "mcq": [{"options": ["The spread of Westernization and consumerism", "The emergence of multinational corporations and international trade", "The movement of people as migrants and refugees", "The destruction of natural habitats and the increase in greenhouse gas emissions"], "q": "Which aspects of globalization have led to both opportunities and challenges for people and places around the world?", "ans": 1}]}, {"name": "1.9 - Gender Issues", "expanded": false, "mcq": [{"options": ["The gender pay gap and access to education for boys", "Cultural norms and traditions that prevent boys from attending school", "Gender-based violence and racial discrimination", "The lack of intersectionality between gender and other forms of inequality"], "q": "Which gender issues are addressed in AP Human Geography, and how do they intersect with other forms of inequality?", "ans": 2}]}], "Unit 2: Population": [{"name": "2.1 - Geographic Patterns and Characteristics", "expanded": false, "mcq": [{"options": ["Natural vegetation distribution", "Cultural practices and traditions", "Climate zones", "Economic systems"], "q": "Which geographic factor is most closely related to the high population densities found in South Asia and Eastern China?", "ans": 2}]}, {"name": "2.2 - Population Growth and Decline", "expanded": false, "mcq": [{"options": ["High death rate and negative net migration", "Low birth rate and positive net migration", "Economic instability and political instability", "High death rate and negative net migration, but only in certain regions"], "q": "Which factors contribute to population growth in AP Human Geography?", "ans": 1}]}, {"name": "2.3 - Causes and Consequences of Migration", "expanded": false, "mcq": [{"options": ["Political instability and war", "Poverty and unemployment", "Family reunification and marriage", "Cultural exchange and demographic changes", "Poverty and unemployment."], "q": "Which factors can lead to economic migration in AP Human Geography?", "ans": 0}]}], "Unit 3: Cultural Patterns and Processes": [{"name": "3.1 - Cultural Systems", "expanded": false, "mcq": [{"options": ["Natural resources and their use", "Social organization and power distribution", "Language and its influence on perception", "Religion and its impact on beliefs and practices"], "q": "Which of the following best describes a key component of cultural systems in AP Human Geography?", "ans": 2}]}, {"name": "3.2 - Social Systems", "expanded": false, "mcq": [{"options": ["Economic system", "Religious system", "Political system", "Family system"], "q": "Which of the following social systems in AP Human Geography determines how power is distributed and exercised within a society?", "ans": 2}]}, {"name": "3.3 - Economic Systems", "expanded": false, "mcq": [{"options": ["Traditional Economy", "Command Economy", "Market Economy", "Mixed Economy"], "q": "Which economic system is characterized by the government owning and controlling the means of production and planning and managing all economic activities?", "ans": 1}]}, {"name": "3.4 - Political Systems", "expanded": false, "mcq": [{"options": ["Constitutional Monarchy", "Parliamentary System", "Presidential System", "Theocracy"], "q": "Which political system allows religious leaders to hold political power and make laws?", "ans": 3}]}], "Unit 4: Political Organization of Space": [{"name": "4.1 - Political Systems", "expanded": false, "mcq": [{"options": ["Constitutional Monarchy: The monarch has limited powers by a constitution, but citizens also elect representatives to make laws. (Answer: A)", "Presidential Democracy: Citizens elect both the president and legislators, but there is no monarch.", "Totalitarian Regime: One person or group has complete control over all aspects of society, with no constitutional limits.", "Theocracy: Political power is held by religious leaders, with no elected representatives or constitutional limits."], "q": "Which political system combines elements of both a monarchy and a parliamentary democracy?", "ans": 0}]}, {"name": "4.2 - Political Geography", "expanded": false, "mcq": [{"options": ["Artificial boundary", "Colonial boundary", "Democratic boundary", "Natural boundary"], "q": "Which type of political boundary is primarily influenced by natural features such as mountains, rivers, and oceans?", "ans": 3}]}, {"name": "4.3 - Political Maps", "expanded": false, "mcq": [{"options": ["A fully integrated part of a sovereign state", "An area under the political control of a sovereign state but economically and socially distinct", "An international border between two sovereign states", "A capital city of a country"], "q": "Which of the following best describes the political entity represented by the term \"dependency\" on a political map?", "ans": 1}]}, {"name": "4.4 - Political Boundaries", "expanded": false, "mcq": [{"options": ["They have no impact on the distribution of power and resources within and between nations.", "They are primarily used to demarcate administrative divisions within countries.", "They are the result of historical events, treaties, or negotiations between countries, and impact the distribution of power and resources.", "They are not recognized by the international community and are constantly contested or disputed."], "q": "Which of the following best describes the political significance of international borders in AP Human Geography?", "ans": 2}]}], "Unit 5: Agricultural and Rural Land Use": [{"name": "5.1 - Agricultural Systems", "expanded": false, "mcq": [{"options": ["Traditional Agriculture", "Industrial Agriculture", "Agro-industrial Systems", "Organic Agriculture", "Organic Agriculture."], "q": "Which agricultural system primarily relies on natural methods of pest control and fertilization, and avoids the use of synthetic fertilizers and pesticides?", "ans": 3}]}, {"name": "5.2 - Rural Land Use", "expanded": false, "mcq": [{"options": ["Irrigated agriculture", "Rain-fed agriculture", "Mining", "Grazing"], "q": "Which of the following rural land uses is most commonly associated with arid regions and involves raising livestock?", "ans": 3}]}, {"name": "5.3 - Agricultural Geography", "expanded": false, "mcq": [{"options": ["Tropical Rainforest", "Temperate Deciduous Forest", "Mediterranean", "Arid Desert"], "q": "Which agricultural zone is known for its dry, hot summers and mild, wet winters, making it ideal for growing grapes, olives, and citrus fruits?", "ans": 2}]}, {"name": "5.4 - Agricultural Maps", "expanded": false, "mcq": [{"options": ["Crop map", "Soil map", "Irrigation map", "Climate map"], "q": "Which type of agricultural map best illustrates the location and extent of irrigation systems?", "ans": 2}]}], "Unit 6: Industrialization and Economic Development": [{"name": "6.1 - Industrial Systems", "expanded": false, "mcq": [{"options": ["Manufacturing", "Service", "Extractive", "Agriculture"], "q": "Which industry type is primarily involved in the extraction of natural resources from the earth?", "ans": 2}]}, {"name": "6.2 - Economic Systems", "expanded": false, "mcq": [{"options": ["Traditional Economy", "Command Economy", "Market Economy (Capitalist)", "Socialist Economy", "Market Economy (Capitalist)"], "q": "Which economic system is characterized by privately owned means of production and a profit motive as the primary driver of economic activities?", "ans": 2}]}, {"name": "6.3 - Economic Geography", "expanded": false, "mcq": [{"options": ["Manufacturing and service industries", "Agriculture and fishing", "Mining and extraction of natural resources", "Technology and innovation industries"], "q": "Which economic activities are more likely to be found in countries with abundant natural resources, and why?", "ans": 2}]}, {"name": "6.4 - Economic Maps", "expanded": false, "mcq": [{"options": ["World Map of Gross Domestic Product (GDP)", "Trade Map", "World Map of Income Levels", "Population Density Map"], "q": "Which type of economic map best illustrates the flow of goods and services between countries?", "ans": 1}]}], "Unit 7: Cities and Urban Land Use": [{"name": "7.1 - Urban Systems", "expanded": false, "mcq": [{"options": ["Designing transportation networks to reduce congestion", "Creating green spaces to improve air quality", "Developing businesses to generate economic opportunities", "Providing essential services such as water and sewage systems"], "q": "Which of the following is a primary focus of urban planning in managing urban systems?", "ans": 0}]}, {"name": "7.2 - Urban Land Use", "expanded": false, "mcq": [{"options": ["Areas for residential living", "Locations for commercial businesses and services", "Zones for transportation infrastructure", "Areas for factories and other industrial operations"], "q": "Which of the following best describes the function of industrial zones in urban land use?", "ans": 3}]}, {"name": "7.3 - Urban Geography", "expanded": false, "mcq": [{"options": ["Urbanization and population growth", "Land use and urban form", "Infrastructure and services", "Urban economy"], "q": "Which of the following is a key concept in the study of urban geography related to the economic activities in cities?", "ans": 3}]}, {"name": "7.4 - Urban Maps", "expanded": false, "mcq": [{"options": ["Provide visual representations of cities' historical development", "Reveal the distribution and interaction of residential, commercial, and industrial areas", "Offer insights into population density and infrastructure accessibility", "All of the above", "All of the above."], "q": "Which of the following best describes the role of urban maps in AP Human Geography?", "ans": 3}]}]}